Catalogs/бит_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСоответствийИменВложенийИдентификаторам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторФайлаДляHTML</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/бит_СпособыРедактированияЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СпособыРедактированияЭлектронныхПисем</Name>
			<Comment>БИТ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбычныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ТипыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыТекстовЭлектронныхПисем</Name>
			<Comment>БИТ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмеченныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ШаблоныСообщений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ДействияКомандФормы

&НаКлиенте
Процедура HTML(Команда)
	
	Если ФорматСообщения <> ПредопределенноеЗначение("Перечисление.бит_СпособыРедактированияЭлектронныхПисем.HTML") Тогда
		
		ФорматСообщения = ПредопределенноеЗначение("Перечисление.бит_СпособыРедактированияЭлектронныхПисем.HTML");
		ФорматСообщенияПриИзменении(Новый ОписаниеОповещения("HTMLЗавершение", ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура HTMLЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОбычныйТекст(Команда)
	
	Если ФорматСообщения <> ПредопределенноеЗначение("Перечисление.бит_СпособыРедактированияЭлектронныхПисем.ОбычныйТекст") Тогда
		
		ФорматСообщения = ПредопределенноеЗначение("Перечисление.бит_СпособыРедактированияЭлектронныхПисем.ОбычныйТекст");
		ФорматСообщенияПриИзменении(Новый ОписаниеОповещения("ОбычныйТекстЗавершение", ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбычныйТекстЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
	Завершение = Истина;   

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДокументHTMLТекущегоПисьмаПодготовлен = Ложь;
	
	// Подготовим документ HTML из содержимого форматированного документа.
	Если ФорматСообщения = Перечисления.бит_СпособыРедактированияЭлектронныхПисем.HTML Тогда
		
		ТекущийОбъект.ТаблицаСоответствийИменВложенийИдентификаторам.Очистить();
		
		СтруктураВложений = Новый Структура;
		ТекстШаблонаФорматированныйДокумент.ПолучитьHTML(ТекущийОбъект.ТекстHTML, СтруктураВложений);
		Для каждого Вложение Из СтруктураВложений Цикл
			
			НоваяСтрока = ТекущийОбъект.ТаблицаСоответствийИменВложенийИдентификаторам.Добавить();
			НоваяСтрока.ИмяФайла = Вложение.Ключ;
			НоваяСтрока.ИдентификаторФайлаДляHTML = Новый УникальныйИдентификатор;
			НоваяСтрока.Картинка = Новый ХранилищеЗначения(Вложение.Значение.ПолучитьДвоичныеДанные());
			
		КонецЦикла;

		Если ТекущийОбъект.ТаблицаСоответствийИменВложенийИдентификаторам.Количество() > 0 Тогда
			
			ДокументHTML = бит_УправлениеЭлектроннойПочтойСервер.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекущийОбъект.ТекстHTML);
			бит_УправлениеЭлектроннойПочтойСервер.ЗаменитьИменаКартинокНаИдентификаторыПочтовыхВложенийВHTML(
												ДокументHTML, ТекущийОбъект.ТаблицаСоответствийИменВложенийИдентификаторам.Выгрузить());
			ДокументHTMLТекущегоПисьмаПодготовлен = Истина;
			
		КонецЕсли;
		
	Иначе
		
		ТекущийОбъект.Текст = ТекстШаблона;
		
	КонецЕсли;
	
	Если ДокументHTMLТекущегоПисьмаПодготовлен Тогда
		
		ТекущийОбъект.ТекстHTML = бит_УправлениеЭлектроннойПочтойСервер.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		ТекущийОбъект.Текст     = бит_УправлениеЭлектроннойПочтойСервер.ПолучитьОбычныйТекстИзHTML(ТекущийОбъект.ТекстHTML);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОпределитьСпособРедактированияПисьма();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура ФорматСообщенияПриИзменении(Знач Оповещение)
	
	Если Объект.ТипТекста <> ПредопределенноеЗначение("Перечисление.бит_ТипыТекстовЭлектронныхПисем.ПростойТекст") И 
		ФорматСообщения = ПредопределенноеЗначение("Перечисление.бит_СпособыРедактированияЭлектронныхПисем.ОбычныйТекст") Тогда
		
		ТекстСообщения = НСтр("ru='При преобразовании этого сообщения в обычный текст будут утеряны все элементы оформления, картинки и прочие вставленные элементы. Продолжить?'");
		Результат = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ФорматСообщенияПриИзмененииЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), ТекстСообщения, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Изменение формата письма'"));
        Возврат;
		
	Иначе
		
		ТекстШаблонаФорматированныйДокумент.Добавить(ТекстШаблона);
		Объект.Текст = "";
		Объект.ТипТекста =  ПредопределенноеЗначение("Перечисление.бит_ТипыТекстовЭлектронныхПисем.HTML");
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ФорматированныйДокумент;
		
	КонецЕсли;
	
	ФорматСообщенияПриИзмененииФрагмент(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ФорматСообщенияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    
    Результат = РезультатВопроса;
    
    Если Результат = КодВозвратаДиалога.Нет Тогда
        ФорматСообщения = ПредопределенноеЗначение("Перечисление.бит_СпособыРедактированияЭлектронныхПисем.HTML");
        ВыполнитьОбработкуОповещения(Оповещение);
        Возврат;
    КонецЕсли;
    
    ТекстШаблона = ТекстШаблонаФорматированныйДокумент.ПолучитьТекст();
    Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.бит_ТипыТекстовЭлектронныхПисем.ПростойТекст");
    ТекстШаблонаФорматированныйДокумент.Удалить();
    Элементы.ТекстШаблона.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;
    Объект.ТекстHTML = "";
    Объект.Кодировка = "UTF-8";
    Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ОбычныйТекст;
   
    ФорматСообщенияПриИзмененииФрагмент(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ФорматСообщенияПриИзмененииФрагмент(Знач Оповещение)
    
    Элементы.ФорматСообщения.Заголовок = ФорматСообщения;
    
    ВыполнитьОбработкуОповещения(Оповещение);

КонецПроцедуры

&НаСервере
Процедура ОпределитьСпособРедактированияПисьма()

	Если Объект.ТипТекста.Пустая() Тогда
		
		ФорматСообщения = Перечисления.бит_СпособыРедактированияЭлектронныхПисем.HTML;
		
		// Если тип текста не был заполнен, то может оказаться, что формат выбран некорректно, поэтому:
		// 1) Если текст заполнен, но не заполнен HTML - то формат сообщения исправляем на "текст".
		// 2) Если HTML заполнен, но не заполнен текст - то формат сообщения исправляем на "HTML".
		Если ФорматСообщения = Перечисления.бит_СпособыРедактированияЭлектронныхПисем.ОбычныйТекст 
			И СокрЛП(Объект.Текст) = "" И СокрЛП(Объект.ТекстHTML) <> "" Тогда
			ФорматСообщения = Перечисления.бит_СпособыРедактированияЭлектронныхПисем.HTML;
		ИначеЕсли ФорматСообщения = Перечисления.бит_СпособыРедактированияЭлектронныхПисем.HTML
			И СокрЛП(Объект.Текст) <> "" И СокрЛП(Объект.ТекстHTML) = "" Тогда
			ФорматСообщения = Перечисления.бит_СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
		КонецЕсли;
		
	Иначе
		Если Объект.ТипТекста = Перечисления.бит_ТипыТекстовЭлектронныхПисем.ПростойТекст Тогда
			ФорматСообщения = Перечисления.бит_СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
		Иначе
			ФорматСообщения = Перечисления.бит_СпособыРедактированияЭлектронныхПисем.HTML;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФорматСообщения = Перечисления.бит_СпособыРедактированияЭлектронныхПисем.HTML Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ФорматированныйДокумент;
		Объект.ТипТекста = Перечисления.бит_ТипыТекстовЭлектронныхПисем.HTML;
		Если Не Объект.Ссылка.Пустая() Тогда
			СтруктураВложений = Новый Структура;
			Объект.ТекстHTML = бит_УправлениеЭлектроннойПочтойСервер.ОбработатьТекстШаблонаHTMLДляФорматированногоДокумента(
				Объект.Ссылка, Объект.ТекстHTML,СтруктураВложений);
			ТекстШаблонаФорматированныйДокумент.УстановитьHTML(Объект.ТекстHTML, СтруктураВложений);
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ОбычныйТекст;
		Элементы.ТекстШаблона.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;
		Объект.ТипТекста = Перечисления.бит_ТипыТекстовЭлектронныхПисем.ПростойТекст;
		ТекстШаблона = Объект.Текст;
		Объект.Кодировка = "UTF-8";
		
	КонецЕсли;
	
	Элементы.ФорматСообщения.Видимость = Истина;
	Элементы.ФорматСообщения.Заголовок = ФорматСообщения;
	
КонецПроцедуры

#КонецОбласти
